- Course: **[DataCamp: Joining Data in SQL][2]**
- Notebook Author: [Trenton McKinney][1]
 - This notebook was created so I'd have a reproducible reference.
 - The material is from the course
 - I completed the exercises

  [1]: https://trenton3983.github.io/
  [2]: https://www.datacamp.com/courses/joining-data-in-postgresql

**Course Description**

Now that you've learned the basics of SQL in our [Intro to SQL for Data Science](https://www.datacamp.com/courses/intro-to-sql-for-data-science) course, it's time to supercharge your queries using joins and relational set theory! In this course you'll learn all about the power of joining tables while exploring interesting features of countries and their cities throughout the world. You will master inner and outer joins, as well as self-joins, semi-joins, anti-joins and cross joins - fundamental tools in any PostgreSQL wizard's toolbox. You'll fear set theory no more, after learning all about unions, intersections, and except clauses through easy-to-understand diagrams and examples. Lastly, you'll be introduced to the challenging topic of subqueries. You will see a visual perspective to grasp the ideas throughout the course using the mediums of Venn diagrams and other linking illustrations.

**Datasets**

* [Countries](https://assets.datacamp.com/production/repositories/1069/datasets/578834f5908e3b2fa575429a287586d1eaeb2e54/countries2.zip)
* [Leaders](https://assets.datacamp.com/production/repositories/1069/datasets/5aba4b2d25e3025de97d9715a022f5c24b74f347/leaders2.zip)
* [Diagrams](https://assets.datacamp.com/production/repositories/1069/datasets/379b79c12b968edafe24e4bc02fae89d090a9490/diagrams.zip)

**Imports**

In [ ]:
from sqlalchemy import create_engine
from sqlalchemy import MetaData
from sqlalchemy import Table
from sqlalchemy import Column
from sqlalchemy import Integer, String
from sqlalchemy import inspect
import pandas as pd
from pprint import pprint as pp

**Pandas Configuration Options**

In [ ]:
pd.set_option('max_columns', 200)
pd.set_option('max_rows', 300)
pd.set_option('display.expand_frame_repr', True)

**PostgreSQL Connection**

- In order to run this Notebook, [install][1], setup and configure a PostgreSQL database with the previously mentioned datasets.
- Edit `engine` to use your database username and password.

  [1]: https://www.postgresql.org/download/

In [ ]:
engine = create_engine('postgresql://postgres:postgres@localhost/postgres')

In [ ]:
meta = MetaData(schema="countries")

In [ ]:
conn = engine.connect()

**Example(s) without pd.DataFrames - use fetchall**

In [ ]:
result = conn.execute("SELECT datname from pg_database")

In [ ]:
rows = result.fetchall()

In [ ]:
[x for x in rows]

In [ ]:
cities = conn.execute("select * \
from countries.countries \
inner join countries.cities \
on countries.cities.country_code = countries.code")

In [ ]:
cities_res = cities.fetchall()

In [ ]:
cities_list = [x for i, x in enumerate(cities_res) if i < 10]

In [ ]:
cities_list

# Introduction to joins

In this chapter, you'll be introduced to the concept of joining tables, and explore the different ways you can enrich your queries using inner joins and self-joins. You'll also see how to use the case statement to split up a field into different categories.

## Introduction to INNER JOIN

In [ ]:
cities = conn.execute("select * from countries.cities")

In [ ]:
cities_df = pd.read_sql("select * from countries.cities", conn)

In [ ]:
cities_df.head()

In [ ]:
sql_stmt = "SELECT * FROM countries.cities INNER JOIN countries.countries ON countries.cities.country_code = countries.countries.code"
pd.read_sql(sql_stmt, conn).head()

In [ ]:
sql_stmt = "SELECT countries.cities.name as city, countries.countries.name as country, \
countries.countries.region FROM countries.cities INNER JOIN countries.countries ON \
countries.cities.country_code = countries.countries.code"
pd.read_sql(sql_stmt, conn).head()

## INNER JOIN via USING

![](https://github.com/trenton3983/DataCamp/blob/master/Images/joining_data_in_sql/inner_join_diagram_small.JPG?raw=true)

```sql
SELECT left_table.id as L_id
       left_table.val as L_val
       right_table.val as R_val
FROM left_table
INNER JOIN right_table
ON left_table.id = right_table.id;
```

* When the key field you'd like to join on is the same name in both tables, you can use a `USING` clause instead of the `ON` clause.

```sql
SELECT left_table.id as L_id
       left_table.val as L_val
       right_table.val as R_val
FROM left_table
INNER JOIN right_table
USING (id);
```

### Countries with prime ministers and presidents

```sql
SELECT p1.country, p1.continent, prime_minister, president
FROM leaders.presidents AS p1
INNER JOIN leaders.prime_ministers as p2
USING (country);
```

In [ ]:
sql_stmt = "SELECT p1.country, p1.continent, prime_minister, president \
FROM leaders.presidents AS p1 \
INNER JOIN leaders.prime_ministers as p2 \
USING (country)"

pd.read_sql(sql_stmt, conn).head()

### Exercises

#### Review inner join using on

Why does the following code result in an error?

```sql
SELECT c.name AS country, l.name AS language
FROM countries AS c
  INNER JOIN languages AS l;
```

* `INNER JOIN` requires a specification of the key field (or fields) in each table.

#### Inner join with using

When joining tables with a common field name, e.g.

```sql
SELECT *
FROM countries
  INNER JOIN economies
    ON countries.code = economies.code
```

You can use `USING` as a shortcut:

```sql
SELECT *
FROM countries
  INNER JOIN economies
    USING(code)
```

You'll now explore how this can be done with the `countries` and `languages` tables.

**Instructions**

* Inner join `countries` on the left and `languages` on the right with `USING(code)`.
* Select the fields corresponding to:
    * country name `AS country`,
    * continent name,
    * language name `AS language`, and
    * whether or not the language is official.
* Remember to alias your tables using the first letter of their names.

```sql
-- 4. Select fields
SELECT c.name as country, c.continent, l.name as language, l.official
  -- 1. From countries (alias as c)
  FROM countries as c
  -- 2. Join to languages (as l)
  INNER JOIN languages as l
    -- 3. Match using code
    USING (code)
```

In [ ]:
sql_stmt = "SELECT c.name as country, c.continent, l.name as language, l.official \
FROM countries.countries as c \
INNER JOIN countries.languages as l \
USING (code)"

pd.read_sql(sql_stmt, conn).head()

## Self-ish joins, just in CASE

### self-join on prime_ministers

In [ ]:
sql_stmt = "SELECT * \
FROM leaders.prime_ministers"

pm_df = pd.read_sql(sql_stmt, conn)
pm_df.head()

* inner joins where a table is joined with itself
    * self join
* Explore how to slice a numerical field into categories using the CASE command
* Self-joins are used to compare values in a field to other values of the same field from within the same table
* Recall the prime ministers table:
    * What if you wanted to create a new table showing countries that are in the same continenet matched as pairs?

```sql
SELECT p1.country AS country1, p2.country AS country2, p1.continent
FROM leaders.prime_ministers as p1
INNER JOIN prime_ministers as p2
ON p1.continent = p2.continent;
```

In [ ]:
sql_stmt = "SELECT p1.country AS country1, p2.country AS country2, p1.continent \
FROM leaders.prime_ministers as p1 \
INNER JOIN leaders.prime_ministers as p2 \
ON p1.continent = p2.continent"

pm_df_1 = pd.read_sql(sql_stmt, conn)
pm_df_1.head()

* The country column is selected twice as well as continent. 
* The prime ministers table is on both the left and the right.
* The vital step is setting the key columns by which we match the table to itself.
    * For each country, there will be a match if the country in the "right table" (that's also prime_ministers) is in the same continent.
* This is a pairing of each country with every other country in its same continent
    * Conditions where country1 = country2 should not be included in the table

### Finishing off the self-join on prime_ministers

```sql
SELECT p1.country AS country1, p2.country AS country2, p1.continent
FROM leaders.prime_ministers as p1
INNER JOIN prime_ministers as p2
ON p1.continent = p2.continent AND p1.country <> p2.country;
```

In [ ]:
sql_stmt = "SELECT p1.country AS country1, p2.country AS country2, p1.continent \
FROM leaders.prime_ministers as p1 \
INNER JOIN leaders.prime_ministers as p2 \
ON p1.continent = p2.continent AND p1.country <> p2.country"

pm_df_2 = pd.read_sql(sql_stmt, conn)
pm_df_2.head()

In [ ]:
pm_df_1.equals(pm_df_2)

* `AND` clause can check that multiple conditions are met.
* Now a match will not be made between prime_minister and itself if the countries match

### CASE WHEN and THEN

* The states table contains numeric data about different countries in the six inhabited world continents
* Group the year of independence into categories of:
    * before 1900
    * between 1900 and 1930
    * and after 1930
* CASE is a way to do multiple if-then-else statements

```sql
SELECT name, continent, indep_year,
    CASE WHEN indep_year < 1900 THEN 'before 1900'
    WHEN indep_year <= 1930 THEN 'between 1900 and 1930'
    ELSE 'after 1930' END
    AS indep_year_group
FROM states
ORDER BY indep_year_group;
```

In [ ]:
sql_stmt = "SELECT name, continent, indep_year, \
CASE WHEN indep_year < 1900 THEN 'before 1900' \
WHEN indep_year <= 1930 THEN 'between 1900 and 1930' \
ELSE 'after 1930' END \
AS indep_year_group \
FROM leaders.states \
ORDER BY indep_year_group"

pd.read_sql(sql_stmt, conn)

### Exercises

#### Self-join

In this exercise, you'll use the `populations` table to perform a self-join to calculate the percentage increase in population from 2010 to 2015 for each country code!

Since you'll be joining the `populations` table to itself, you can alias `populations` as `p1` and also `populations` as `p2`. This is good practice whenever you are aliasing and your tables have the same first letter. Note that you are required to alias the tables with self-joins.

**Instructions 1/3**
* Join `populations` with itself `ON country_code`.
* Select the `country_code` from `p1` and the `size` field from both `p1` and `p2`. SQL won't allow same-named fields, so alias `p1.size as size2010` and `p2.size as size2015`.

```sql
-- 4. Select fields with aliases
SELECT p1.size as size2010,
    p1.country_code,
    p2.size as size2015
-- 1. From populations (alias as p1)
FROM countries.populations as p1
  -- 2. Join to itself (alias as p2)
    INNER JOIN countries.populations as p2
    -- 3. Match on country code
    ON p1.country_code = p2.country_code
```

In [ ]:
sql_stmt = "SELECT p1.size as size2010, p1.country_code, p2.size as size2015 \
FROM countries.populations as p1 \
INNER JOIN countries.populations as p2 \
ON p1.country_code = p2.country_code"

pd.read_sql(sql_stmt, conn).head()

**Instructions 2/3**

Notice from the result that for each country_code you have four entries laying out all combinations of 2010 and 2015.

* Extend the `ON` in your query to include only those records where the `p1.year` (2010) matches with `p2.year - 5` (2015 - 5 = 2010). This will omit the three entries per `country_code` that you aren't interested in.

```sql
-- 4. Select fields with aliases
SELECT p1.country_code,
       p1.size as size2010,
       p2.size as size2015
-- 1. From populations (alias as p1)
FROM countries.populations as p1
  -- 2. Join to itself (alias as p2)
    INNER JOIN countries.populations as p2
    -- 3. Match on country code
    ON p1.country_code = p2.country_code
      -- 4. and year (with calculation)
      AND p1.year = (p2.year - 5)
```

In [ ]:
sql_stmt = "SELECT p1.size as size2010, p1.country_code, p2.size as size2015 \
FROM countries.populations as p1 \
INNER JOIN countries.populations as p2 \
ON p1.country_code = p2.country_code \
AND p1.year = (p2.year - 5)"

pd.read_sql(sql_stmt, conn).head()

**Instructions 3/3**

As you just saw, you can also use SQL to calculate values like `p2.year - 5` for you. With two fields like `size2010` and `size2015`, you may want to determine the percentage increase from one field to the next:

With two numeric fields `A` and `B`, the percentage growth from `A` to `B` can be calculated as $$\frac{(B−A)}{A}∗100.0$$.

Add a new field to `SELECT`, aliased as `growth_perc`, that calculates the percentage population growth from 2010 to 2015 for each country, using `p2.size` and `p1.size`.


```sql
SELECT p1.country_code,
       p1.size AS size2010, 
       p2.size AS size2015,
       -- 1. calculate growth_perc
       ((p2.size - p1.size)/p1.size * 100.0) AS growth_perc
-- 2. From populations (alias as p1)
FROM countries.populations as p1
  -- 3. Join to itself (alias as p2)
  INNER JOIN countries.populations as p2
    -- 4. Match on country code
    ON p1.country_code = p2.country_code
        -- 5. and year (with calculation)
        AND p1.year = (p2.year - 5);
```

In [ ]:
sql_stmt = "SELECT p1.size as size2010, p1.country_code, p2.size as size2015, \
((p2.size - p1.size)/p1.size * 100.0) AS growth_perc \
FROM countries.populations as p1 \
INNER JOIN countries.populations as p2 \
ON p1.country_code = p2.country_code \
AND p1.year = (p2.year - 5)"

pd.read_sql(sql_stmt, conn).head()

#### Case when and then

Often it's useful to look at a numerical field not as raw data, but instead as being in different categories or groups.

You can use `CASE` with `WHEN`, `THEN`, `ELSE`, and `END` to define a new grouping field.

**Instructions**

Using the countries table, create a new field AS geosize_group that groups the countries into three groups:

* If `surface_area` is greater than 2 million, `geosize_group` is `'large'`.
* If `surface_area` is greater than 350 thousand but not larger than 2 million, `geosize_group` is `'medium'`.
* Otherwise, `geosize_group` is `'small'`.

```sql
SELECT name, continent, code, surface_area,
    -- 1. First case
    CASE WHEN surface_area > 2000000 THEN 'large'
        -- 2. Second case
        WHEN surface_area > 350000 THEN 'medium'
        -- 3. Else clause + end
        ELSE 'small' END
        -- 4. Alias name
        AS geosize_group
-- 5. From table
FROM countries.countries;
```

In [ ]:
sql_stmt = "SELECT name, continent, code, surface_area, \
CASE WHEN surface_area > 2000000 THEN 'large' \
WHEN surface_area > 350000 THEN 'medium' \
ELSE 'small' END \
AS geosize_group \
FROM countries.countries;"

pd.read_sql(sql_stmt, conn).head()

#### Inner challenge

The table you created with the added `geosize_group` field has been loaded for you here with the name `countries_plus`. Observe the use of (and the placement of) the `INTO` command to create this `countries_plus` table:

**If you have downloaded the data from DataCamp and already have a schema for countries, countries_plus is already one of the tables**

```sql
SELECT name, continent, code, surface_area,
    CASE WHEN surface_area > 2000000
            THEN 'large'
       WHEN surface_area > 350000
            THEN 'medium'
       ELSE 'small' END
       AS geosize_group
INTO countries_plus
FROM countries.countries;
```

You will now explore the relationship between the size of a country in terms of surface area and in terms of population using grouping fields created with `CASE`.

By the end of this exercise, you'll be writing two queries back-to-back in a single script. You got this!

**Instructions 1/3**

Using the `populations` table focused only for the `year` 2015, create a new field `AS popsize_group` to organize population `size` into

* `'large'` (> 50 million),
* `'medium'` (> 1 million), and
* `'small'` groups.

Select only the country code, population size, and this new `popsize_group` as fields.

```sql
SELECT country_code, size,
    -- 1. First case
    CASE WHEN size > 50000000 THEN 'large'
        -- 2. Second case
        WHEN size > 1000000 THEN 'medium'
        -- 3. Else clause + end
        ELSE 'small' END
        -- 4. Alias name
        AS popsize_group
-- 5. From table
FROM countries.populations
-- 6. Focus on 2015
WHERE year = 2015;
```

In [ ]:
sql_stmt = "\
SELECT country_code, size, \
CASE WHEN size > 50000000 THEN 'large' \
WHEN size > 1000000 THEN 'medium' \
ELSE 'small' END \
AS popsize_group \
FROM countries.populations \
WHERE year = 2015; \
"

pd.read_sql(sql_stmt, conn).head()

**Instructions 2/3**

* Use `INTO` to save the result of the previous query as `pop_plus`. You can see an example of this in the `countries_plus` code in the assignment text. Make sure to include a `;` at the end of your `WHERE` clause!
* Then, include another query below your first query to display all the records in `pop_plus` using `SELECT * FROM pop_plus`; so that you generate results and this will display `pop_plus` in query result.

**Execute the first part on the PostgreSQL schema to create pop_plus**
```sql
SELECT country_code, size,
    CASE WHEN size > 50000000 THEN 'large'
        WHEN size > 1000000 THEN 'medium'
        ELSE 'small' END
        AS popsize_group
-- 1. Into table        
INTO countries.pop_plus
FROM populations
WHERE year = 2015;
```

**Run this below**
```sql
-- 2. Select all columns of pop_plus
SELECT * FROM countries.pop_plus;
```

In [ ]:
sql_stmt = "\
SELECT * FROM countries.pop_plus; \
"

pd.read_sql(sql_stmt, conn).head()

**Instructions 3/3**

* Keep the first query intact that creates `pop_plus` using `INTO`.
* Write a query to join `countries_plus AS c` on the left with `pop_plus AS p` on the right matching on the country code fields.
* Sort the data based on `geosize_group`, in ascending order so that `large` appears on top.
* Select the `name`, `continent`, `geosize_group`, and `popsize_group` fields.

In [ ]:
sql_stmt = "\
SELECT c.name, c.continent, c.geosize_group, p.popsize_group \
FROM countries.countries_plus AS c \
INNER JOIN countries.pop_plus AS p \
ON c.code = p.country_code \
ORDER BY geosize_group ASC \
"

q_df = pd.read_sql(sql_stmt, conn)
q_df.head()

In [ ]:
q_df.tail()

# Outer JOINs and Cross JOINs

In this chapter, you'll come to grips with different kinds of outer joins. You'll learn how to gain further insights into your data through left joins, right joins, and full joins. In addition to outer joins, you'll also work with cross joins.

## LEFT and RIGHT JOINs

* You can remember outer joins as reaching out to another table while keeping all of the records of the original table.
* Inner joins keep only the records in both tables.
* This chapter will explore three types of OUTER JOINs:
    1. LEFT JOINs
    1. RIGHT JOINs
    1. FULL JOINs
* How a LEFT JOIN differs from an INNER JOIN:

**INNER JOIN**

![](https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/inner_join_diagram_small.JPG?raw=true "INNER JOIN")
* The only records included in the resulting table of the INNER JOIN query were those in which the id field had matching values.

```sql
SELECT p1.country, prime_minister, president
FROM prime_ministers as p1
INNER JOIN presidents p2
ON p1.country = p2.country;
```

**LEFT JOIN**

![](https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/left_join_diagram.JPG?raw=true "Left JOIN")
* In contrast, a LEFT JOIN notes those record in the left table that do not have a match on the key field in the right table.
* This is denoted in the diagram by the open circles remaining close to the left table for id values of 2 and 3.
* Whereas the INNER JOIN kept just the records corresponding to id values 1 and 44, a LEFT JOIN keeps all of the original records in the left table, but then marks the values as missing in the right table for those that don't have a match.
* The syntax of the LEFT JOIN is similar to that of the INNER JOIN.

```sql
SELECT p1.country, prime_minister, president
FROM prime_ministers as p1
LEFT JOIN presidents p2
ON p1.country = p2.country;
```

**LEFT JOIN multiple matches**

![](https://github.com/trenton3983/DataCamp/blob/master/Images/joining_data_in_sql/left_join_multi_diagram.JPG?raw=true "LEFT JOIN multiple entries in right table")
* It isn't always the case that each key value in the left table corresponds to exactly one record in the key column of the right table.
* Duplicate rows are shown in the LEFT JOIN for id 1 since it has two matches corresponding to the values of R1 and R2 in the right2 table.

**RIGHT JOIN**

![](https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/right_join_diagram.JPG?raw=true "RIGHT JOIN - uncommon")
* Instead of matching entries in the id column on the left table to the id column on the right table, a RIGHT JOIN does the reverse.
    * The resulting table from a RIGHT JOIN shows the missing entries in the L_val field.
* In the SQL statement the right table appears after RIGHT JOIN and the left table appears after FROM.

```sql
SELECT right_table.id AS R_id,
       left_table.val AS L_val,
       right_talbe.vale AS R_val
FROM left_table
RIGHT JOIN right_table
ON left_table.id = right_table.id;
```

#### INNER JOIN

In [ ]:
sql_stmt = "\
SELECT p1.country, prime_minister, president \
FROM leaders.prime_ministers as p1 \
INNER JOIN leaders.presidents as p2 \
ON p1.country = p2.country \
"

pd.read_sql(sql_stmt, conn)

#### LEFT JOIN

* The first four records are the same as those from INNER JOIN
* The following records correspond to the countries that do not have a president and thus their president values are missing.

In [ ]:
sql_stmt = "\
SELECT p1.country, prime_minister, president \
FROM leaders.prime_ministers as p1 \
LEFT JOIN leaders.presidents as p2 \
ON p1.country = p2.country \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### LEFT JOIN

Now you'll explore the differences between performing an inner join and a left join using the `cities` and `countries` tables.

You'll begin by performing an inner join with the `cities` table on the left and the `countries` table on the right. Remember to alias the name of the city field as `city` and the name of the country field as `country`.

You will then change the query to a left join. Take note of how many records are in each query here!

**Instructions 1/2**

* Fill in the code based on the instructions in the code comments to complete the inner join. Note how many records are in the result of the join in the **query result** tab.

```sql
-- Select the city name (with alias), the country code,
-- the country name (with alias), the region,
-- and the city proper population
SELECT c1.name AS city, code, c2.name AS country,
       region, city_proper_pop
-- From left table (with alias)
FROM cities AS c1
  -- Join to right table (with alias)
  INNER JOIN countries AS c2
    -- Match on country code
    ON c1.country_code = c2.code
-- Order by descending country code
ORDER BY code DESC;
```

In [ ]:
sql_stmt = "\
SELECT c1.name AS city, code, c2.name AS country, region, city_proper_pop \
FROM countries.cities AS c1 \
INNER JOIN countries.countries AS c2 \
ON c1.country_code = c2.code \
ORDER BY code DESC; \
"

pd.read_sql(sql_stmt, conn).head()

**Instructions 2/2**

* Change the code to perform a `LEFT JOIN` instead of an `INNER JOIN`. After executing this query, note how many records the query result contains.

```sql
SELECT c1.name AS city, code, c2.name AS country,
       region, city_proper_pop
FROM cities AS c1
  -- 1. Join right table (with alias)
  LEFT JOIN countries AS c2
    -- 2. Match on country code
    ON c1.country_code = c2.code
-- 3. Order by descending country code
ORDER BY code DESC;
```

In [ ]:
sql_stmt = "\
SELECT c1.name AS city, code, c2.name AS country, region, city_proper_pop \
FROM countries.cities AS c1 \
LEFT JOIN countries.countries AS c2 \
ON c1.country_code = c2.code \
ORDER BY code DESC; \
"

pd.read_sql(sql_stmt, conn).head()

#### JEFT JOIN (2)

Next, you'll try out another example comparing an inner join to its corresponding left join. Before you begin though, take note of how many records are in both the `countries` and `languages` tables below.

You will begin with an inner join on the `countries` table on the left with the `languages` table on the right. Then you'll change the code to a left join in the next bullet.

Note the use of multi-line comments here using `/*` and `*/`.

**Instructions 1/2**

* Perform an inner join. Alias the name of the `country` field as country and the name of the `language` field as language.
* Sort based on desc

In [ ]:
sql_stmt = "\
SELECT c.name AS country, local_name, l.name AS language, percent \
FROM countries.countries AS c \
INNER JOIN countries.languages AS l \
ON c.code = l.code \
ORDER BY country desc; \
"

res1 = pd.read_sql(sql_stmt, conn)
print(f'Number of Records: {len(res1)}')
res1.head()

**Instructions 2/2**

* Perform a left join instead of an inner join. Observe the result, and also note the change in the number of records in the result.
* Carefully review which records appear in the left join result, but not in the inner join result.

In [ ]:
sql_stmt = "\
SELECT c.name AS country, local_name, l.name AS language, percent \
FROM countries.countries AS c \
LEFT JOIN countries.languages AS l \
ON c.code = l.code \
ORDER BY country desc; \
"

res2 = pd.read_sql(sql_stmt, conn)
print(f'Number of Records: {len(res2)}')
res2.head()

#### LEFT JOIN (3)

Left join (3)
You'll now revisit the use of the `AVG()` function introduced in our [Intro to SQL for Data Science](https://www.datacamp.com/courses/intro-to-sql-for-data-science) course. You will use it in combination with left join to determine the average gross domestic product (GDP) per capita by region in 2010.

**Instructions 1/3**

* Begin with a left join with the `countries` table on the left and the `economies` table on the right.
* Focus only on records with 2010 as the `year`.

In [ ]:
sql_stmt = "\
SELECT name, region, gdp_percapita \
FROM countries.countries AS c \
LEFT JOIN countries.economies AS e \
ON e.code = c.code \
WHERE year = 2010; \
"

res1 = pd.read_sql(sql_stmt, conn)
print(f'Number of Records: {len(res1)}')
res1.head()

**Instructions 2/3**

* Modify your code to calculate the average GDP per capita `AS avg_gdp` for **each region** in 2010.
* Select the `region` and `avg_gdp` fields.

In [ ]:
sql_stmt = "\
SELECT region, AVG(gdp_percapita) as avg_gdp \
FROM countries.countries AS c \
LEFT JOIN countries.economies AS e \
ON e.code = c.code \
WHERE year = 2010 \
GROUP BY region \
ORDER BY avg_gdp DESC; \
"

res2 = pd.read_sql(sql_stmt, conn)
print(f'Number of Records: {len(res2)}')
res2.head()

**Instructions 3/3**

* Arrange this data on average GDP per capita for each region in 2010 from highest to lowest average GDP per capita.

In [ ]:
sql_stmt = "\
SELECT region, AVG(gdp_percapita) as avg_gdp \
FROM countries.countries AS c \
LEFT JOIN countries.economies AS e \
ON e.code = c.code \
WHERE year = 2010 \
GROUP BY region; \
"

res3 = pd.read_sql(sql_stmt, conn)
print(f'Number of Records: {len(res3)}')
res3.head()

#### RIGHT JOIN

Right joins aren't as common as left joins. One reason why is that you can always write a right join as a left join.

**Instructions**

* The left join code is commented out here. Your task is to write a new query using rights joins that produces the same result as what the query using left joins produces. Keep this left joins code commented as you write your own query just below it using right joins to solve the problem.

* Note the order of the joins matters in your conversion to using right joins!
* convert this code to use RIGHT JOINs instead of LEFT JOINs

```sql
SELECT cities.name AS city, urbanarea_pop, countries.name AS country,
       indep_year, languages.name AS language, percent
FROM cities
  LEFT JOIN countries
    ON cities.country_code = countries.code
  LEFT JOIN languages
    ON countries.code = languages.code
ORDER BY city, language;
```

In [ ]:
sql_stmt = "\
SELECT cities.name AS city, urbanarea_pop, countries.name AS country, \
indep_year, languages.name AS language, percent \
FROM countries.languages \
RIGHT JOIN countries.countries \
ON languages.code = countries.code \
RIGHT JOIN countries.cities \
ON cities.country_code = countries.code \
ORDER BY city, language; \
"

pd.read_sql(sql_stmt, conn).head()

## FULL JOINs

- The last of the three types of OUTER JOINs is the FULL JOIN
- Explore the difference between FULL JOIN and other JOINs
 - The instruction will focus on comparing them to INNER JOINs and LEFT JOINs and then to LEFT JOINs and RIGHT JOINs.
- Let's review how the diagram changes between and INNER JOIN and a LEFT JOIN for our basic example using the left and right tables.
- Then we'll delve into the FULL JOIN diagram and is SQL code.
- Recall that an INNER JOIN keeps only the records that have matching key field values in both tables.
 - ![INNER JOIN][1]
- A LEFT JOIN keeps all of the records in the left table while bringing in missing values for those key field values that don't appear in the right table.
 - ![LEFT JOIN][2]
- Let's review the differences between a LEFT JOIN and a RIGHT JOIN.
 - ![RIGHT JOIN][3]
 - The id values of 2 and 3 in the left table do not match with the id values in the right table, so missing values are brought in for them in the LEFT JOIN. 
 - Likewise for the RIGHT JOIN, missing values are brought in for id values of 5 and 6.
- A **FULL JOIN** combines a LEFT JOIN and RIGHT JOIN as you can see in the diagram.
 - ![FULL JOIN][4]
 - It will bring in all record from both the left and the right table and keep track of the missing values accordingly.
 - Note the missing values here and all six of the values of id are included in the table.
- You can also see from the SQL code, to produce this FULL JOIN result, the general format aligns closely with the SQL syntax seen for an INNER JOIN and a LEFT JOIN.

```sql
SELECT left_table.id AS L_id,
       right_table.id AS R_id,
       left_table.val AS L_val,
       right_table.val as R_val,
FULL left_table
FULL JOIN right_table
USING (id);
```

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/inner_join_diagram_small.JPG?raw=true "INNER JOIN"
  [2]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/left_join_diagram.JPG?raw=true "LEFT JOIN"
  [3]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/right_join_diagram.JPG?raw=true "RIGHT JOIN"
  [4]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/full_join_2.JPG?raw=true "FULL JOIN"

### FULL JOIN example using leaders database

- Let's revisit the example of looking at countries with prime ministers and / or presidents.
- Query breakdown:
 - The SELECT statement includes the country field from both tables of interest and also the prime_minister and president fields.
 - The left table is specified as prime_ministers with the alias of p1
 - The order matters and if you switched the two tables, the output would be slightly different.
 - The right table is specified as presidents with the alias of p2
 - The join is done based on the key field of country in both tables

```sql
SELECT p1.country AS pm_co, p2.country AS pres_co, prime_minister, president
FROM prime_ministers AS p1
FULL JOIN presidents AS p2
ON p1.country = p2.country;
```

In [ ]:
sql_stmt = "\
SELECT p1.country AS pm_co, p2.country AS pres_co, prime_minister, president \
FROM leaders.prime_ministers AS p1 \
FULL JOIN leaders.presidents AS p2 \
ON p1.country = p2.country; \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### FULL JOIN

In this exercise, you'll examine how your results differ when using a full join versus using a left join versus using an inner join with the `countries` and `currencies` tables.

You will focus on the North American `region` and also where the `name` of the country is missing. Dig in to see what we mean!

Begin with a full join with `countries` on the left and `currencies` on the right. The fields of interest have been `SELECT`ed for you throughout this exercise.

Then complete a similar left join and conclude with an inner join.

**Instructions 1/3**

1. Choose records in which region corresponds to North America or is NULL.

```sql
SELECT name AS country, code, region, basic_unit
-- 3. From countries
FROM countries
  -- 4. Join to currencies
  FULL JOIN currencies
    -- 5. Match on code
    USING (code)
-- 1. Where region is North America or null
WHERE region = 'North America' OR region IS null
-- 2. Order by region
ORDER BY region;
```

In [ ]:
sql_stmt = "\
SELECT name AS country, code, region, basic_unit \
FROM countries.countries \
  FULL JOIN countries.currencies \
    USING (code) \
WHERE region = 'North America' OR region IS null \
ORDER BY region; \
"

pd.read_sql(sql_stmt, conn)

**Instructions 2/3**

2. Repeat the same query as above but use a `LEFT JOIN` instead of a `FULL JOIN`. Note what has changed compared to the `FULL JOIN` result!

```sql
SELECT name AS country, code, region, basic_unit
-- 3. From countries
FROM countries
  -- 4. Join to currencies
  LEFT JOIN currencies
    -- 5. Match on code
    USING (code)
-- 1. Where region is North America or null
WHERE region = 'North America' OR region IS null
-- 2. Order by region
ORDER BY region;
```

In [ ]:
sql_stmt = "\
SELECT name AS country, code, region, basic_unit \
FROM countries.countries \
  LEFT JOIN countries.currencies \
    USING (code) \
WHERE region = 'North America' OR region IS null \
ORDER BY region; \
"

pd.read_sql(sql_stmt, conn)

**Instruction 3/3**

3. Repeat the same query as above but use an `INNER JOIN` instead of a `FULL JOIN`. Note what has changed compared to the `FULL JOIN` and `LEFT JOIN` results!

```sql
SELECT name AS country, code, region, basic_unit
-- 3. From countries
FROM countries
  -- 4. Join to currencies
  INNER JOIN currencies
    -- 5. Match on code
    USING (code)
-- 1. Where region is North America or null
WHERE region = 'North America' OR region IS null
-- 2. Order by region
ORDER BY region;
```

In [ ]:
sql_stmt = "\
SELECT name AS country, code, region, basic_unit \
FROM countries.countries \
  INNER JOIN countries.currencies \
    USING (code) \
WHERE region = 'North America' OR region IS null \
ORDER BY region; \
"

pd.read_sql(sql_stmt, conn)

**Have you kept an eye out on the different numbers of records these queries returned? The `FULL JOIN` query returned 17 rows, the `LEFT JOIN` returned 4 rows, and the `INNER JOIN` only returned 3 rows. Do these results make sense to you?**

#### FULL JOIN (2)

You'll now investigate a similar exercise to the last one, but this time focused on using a table with more records on the left than the right. You'll work with the `languages` and `countries` tables.

Begin with a full join with `languages` on the left and `countries` on the right. Appropriate fields have been selected for you again here.

**Instructions 1/3**

1. Choose records in which `countries.name` starts with the capital letter `'V'` or is `NULL` and arrange by `countries.name` in **ascending** order to more clearly see the results.

```sql
SELECT countries.name, code, languages.name AS language
-- 3. From languages
FROM languages
  -- 4. Join to countries
  FULL JOIN countries
    -- 5. Match on code
    USING (code)
-- 1. Where countries.name starts with V or is null
WHERE countries.name LIKE 'V%' OR countries.name IS null
-- 2. Order by ascending countries.name
ORDER BY countries.name;
```

In [ ]:
sql_stmt = "\
SELECT countries.name, code, languages.name AS language \
FROM countries.languages \
  FULL JOIN countries.countries \
    USING (code) \
WHERE countries.name LIKE 'V%%' OR countries.name IS null \
ORDER BY countries.name; \
"

pd.read_sql(sql_stmt, conn)

**Instructions 2/3**

2. Repeat the same query as above but use a `left join` instead of a full join. Note what has changed compared to the full join result!

```sql
SELECT countries.name, code, languages.name AS language
-- 3. From languages
FROM languages
  -- 4. Join to countries
  LEFT JOIN countries
    -- 5. Match on code
    USING (code)
-- 1. Where countries.name starts with V or is null
WHERE countries.name LIKE 'V%' OR countries.name IS null
-- 2. Order by ascending countries.name
ORDER BY countries.name;
```

In [ ]:
sql_stmt = "\
SELECT countries.name, code, languages.name AS language \
FROM countries.languages \
  LEFT JOIN countries.countries \
    USING (code) \
WHERE countries.name LIKE 'V%%' OR countries.name IS null \
ORDER BY countries.name; \
"

pd.read_sql(sql_stmt, conn)

**Instructions 3/3**

3. Repeat once more, but use an `inner join` instead of a left join. Note what has changed compared to the full join and left join results.

```sql
SELECT countries.name, code, languages.name AS language
-- 3. From languages
FROM languages
  -- 4. Join to countries
  INNER JOIN countries
    -- 5. Match on code
    USING (code)
-- 1. Where countries.name starts with V or is null
WHERE countries.name LIKE 'V%' OR countries.name IS null
-- 2. Order by ascending countries.name
ORDER BY countries.name;
```

In [ ]:
sql_stmt = "\
SELECT countries.name, code, languages.name AS language \
FROM countries.languages \
  INNER JOIN countries.countries \
    USING (code) \
WHERE countries.name LIKE 'V%%' OR countries.name IS null \
ORDER BY countries.name; \
"

pd.read_sql(sql_stmt, conn)

#### FULL JOIN (3)

You'll now explore using two consecutive full joins on the three tables you worked with in the previous two exercises.

**Instructions**

* Complete a full join with `countries` on the left and `languages` on the right.
* Next, full join this result with `currencies` on the right.
* Use `LIKE` to choose the Melanesia and Micronesia regions (Hint: `'M%esia'`).
* Select the fields corresponding to the country name `AS country`, region, language name `AS language`, and basic and fractional units of currency.

```sql
-- 7. Select fields (with aliases)
SELECT c1.name AS country, region, l.name AS language,
       basic_unit, frac_unit
-- 1. From countries (alias as c1)
FROM countries AS c1
  -- 2. Join with languages (alias as l)
  FULL JOIN languages AS l
    -- 3. Match on code
    USING (code)
  -- 4. Join with currencies (alias as c2)
  FULL JOIN currencies AS c2
    -- 5. Match on code
    USING (code)
-- 6. Where region like Melanesia and Micronesia
WHERE region LIKE 'M%esia';
```

In [ ]:
sql_stmt = "\
SELECT c1.name AS country, region, l.name AS language, \
       basic_unit, frac_unit \
FROM countries.countries AS c1 \
  FULL JOIN countries.languages AS l \
    USING (code) \
  FULL JOIN countries.currencies AS c2 \
    USING (code) \
WHERE region LIKE 'M%%esia'; \
"

pd.read_sql(sql_stmt, conn)

#### Review OUTER JOINs

A(n) `___` join is a join combining the results of a `___` join and a `___` join.

**Answer the question**

* ~~left, full, right~~
* ~~right, full, left~~
* ~~inner, left, right~~
* __**None of the above are true**__

## CROSSing the rubicon

- CROSS JOINs create all possible combinations of two tables.
- ![cross join][1]
- The resulting table is comprised of all 9 combinations if `id` from `table1` and `id` from `table2` (e.g. 1(A-C), 2(A-C), & 3(A-C))

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/cross_join.JPG?raw=true "INNER JOIN"

### CROSS JOIN example: Pairing prime ministers with presidents

- Suppose all prime ministers in North America and Oceania in the `prime_ministers` table are scheduled for individual meetings with all presidents in the presidents table.
- All the combinations can be created with a CROSS JOIN

```sql
SELECT prime_minister, president
FROM prime_ministers AS p1
CROSS JOIN presidents AS p2
WHERE p1.continent IN ('North America', 'Oceania');
```

In [ ]:
sql_stmt = "\
SELECT prime_minister, president \
FROM leaders.prime_ministers AS p1 \
CROSS JOIN leaders.presidents AS p2 \
WHERE p1.continent IN ('North America', 'Oceania'); \
"

pd.read_sql(sql_stmt, conn)

#### Exercises

##### A table of two cities

This exercise looks to explore languages potentially and most frequently spoken in the cities of Hyderabad, India and Hyderabad, Pakistan.

You will begin with a cross join with `cities AS c` on the left and `languages AS l` on the right. Then you will modify the query using an inner join in the next tab.

**Instructions 1/2**

* Create the cross join as described above. (Recall that cross joins do **not** use `ON` or `USING`.)
* Make use of `LIKE` and `Hyder%` to choose Hyderabad in both countries.
* Select only the city name `AS city` and language name `AS language`.

```sql
-- 4. Select fields
SELECT c.name AS city, l.name AS language
-- 1. From cities (alias as c)
FROM cities AS c        
  -- 2. Join to languages (alias as l)
  CROSS JOIN languages AS l
-- 3. Where c.name like Hyderabad
WHERE c.name LIKE 'Hyder%';
```

In [ ]:
sql_stmt = "\
SELECT c.name AS city, l.name AS language \
FROM countries.cities AS c \
  CROSS JOIN countries.languages AS l \
WHERE c.name LIKE 'Hyder%%'; \
"

hyderabad_lang = pd.read_sql(sql_stmt, conn)
hyderabad_lang

In [ ]:
unique_lang = hyderabad_lang['language'].unique()
print(len(unique_lang))

**Instructions 2/2**

- Use an inner join instead of a cross join. Think about what the difference will be in the results for this inner join result and the one for the cross join.

```sql
-- 5. Select fields
SELECT c.name AS city, l.name AS language
-- 1. From cities (alias as c)
FROM cities as c      
  -- 2. Join to languages (alias as l)
  INNER JOIN languages AS l
    -- 3. Match on country code
    ON c.country_code = l.code
-- 4. Where c.name like Hyderabad
WHERE c.name like 'Hyder%';
```

In [ ]:
sql_stmt = "\
SELECT c.name AS city, l.name AS language \
FROM countries.cities AS c \
  INNER JOIN countries.languages AS l \
    ON c.country_code = l.code \
WHERE c.name LIKE 'Hyder%%'; \
"

pd.read_sql(sql_stmt, conn)

##### Outer challenge

Now that you're fully equipped to use outer joins, try a challenge problem to test your knowledge!

In terms of life expectancy for 2010, determine the names of the lowest five countries and their regions.

**Instructions**

* Select country name `AS country`, `region`, and life expectancy `AS life_exp`.
* Make sure to use `LEFT JOIN`, `WHERE`, `ORDER BY`, and `LIMIT`.

```sql
-- Select fields
SELECT c.name AS country, c.region, p.life_expectancy AS life_exp
-- From countries (alias as c)
FROM countries AS c
  -- Join to populations (alias as p)
  LEFT JOIN populations AS p
    -- Match on country code
    ON c.code = p.country_code
-- Focus on 2010
WHERE p.year = 2010
-- Order by life_exp
ORDER BY life_exp
-- Limit to 5 records
LIMIT 5;
```

In [ ]:
sql_stmt = "\
SELECT c.name AS country, c.region, p.life_expectancy AS life_exp \
FROM countries.countries AS c \
  LEFT JOIN countries.populations AS p \
    ON c.code = p.country_code \
WHERE p.year = 2010 \
ORDER BY life_exp \
LIMIT 5; \
"

pd.read_sql(sql_stmt, conn)

# Set theory clauses

In this chapter, you'll learn more about set theory using Venn diagrams and you will be introduced to union, union all, intersect, and except clauses. You'll finish by investigating semi-joins and anti-joins, which provide a nice introduction to subqueries.

## State of the UNION

- Focus on the operations UNION and UNION ALL.
- In addition to joining diagrams, you'll see how Venn diagrams can be used to represent set operations.
- ![set theory venn diagrams][1]
- Think of each circle as representing a table of data
- The shading represents what's included in the result of the set operation from each table.
- **`UNION`** includes every record in both tables, but **DOES NOT** double count those that are in both tables.
- **`UNION ALL`** includes every record in both tables and **DOES** replicate those that are in both tables, represented by the black center
- The two diagrams on the bottom represent only the subsets of data being selected.
- **`INTERSECT`** results in only those records found in both of the tables.
- **`EXCEPT`** results in only those records in one table, **BUT NOT** the other.
- ![union][2]
 - Given two tables with name `left_one` and `right_one`, `one` corresponds to each table having one field.
 - If you run a `UNION` on these two fields, the result is each record appearing in either table, but notice the id values of `1` and `4` in `right_one`, are not included again in the `UNION` since they were already found in the `left_one` table.
- ![union all][3]
 - `UNION ALL` includes all duplicates in its result, resulting in 8 total records for the example.

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/venn.JPG?raw=true "set theory venn diagrams"
  [2]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/union.JPG?raw=true "union"
  [3]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/union_all.JPG?raw=true "union all"

### UNION & UNION ALL example

- `monarchs` table in the `leaders` database
- Use `UNION` on the `prime_ministers` and `monarchs` tables
- all prime ministers and monarchs

```sql
SELECT prime_minister AS leader, country
FROM leaders.prime_ministers
UNION
SELECT monarch, country
FROM leaders.monarchs
ORDER BY country;
```

- Note that the `prime_minister` field has been aliased as leader.  The resulting field from the `UNION` will have the name **leader**.
 - This is an important property of _set theory_ clauses
- The fields included in the operation must be of the same data type since they are returned as a single field.
 - A number field can't be stacked on top of a character field.
- Spain and Norway have a prime minister and a monarch, while Brunei and Oman have a monarch who also acts as a prime minister.

```sql
SELECT prime_minister AS leader, country
FROM leaders.prime_ministers
UNION ALL
SELECT monarch, country
FROM leaders.monarchs
ORDER BY country;
```

- `UNION` and `UNION ALL` clauses do not do the lookup step that `JOIN`s do, they stack records on top of each other from one table to the next.

In [ ]:
sql_stmt = "\
SELECT * \
FROM leaders.monarchs; \
"

pd.read_sql(sql_stmt, conn)

In [ ]:
sql_stmt = "\
SELECT prime_minister AS leader, country \
FROM leaders.prime_ministers \
UNION \
SELECT monarch, country \
FROM leaders.monarchs \
ORDER BY country; \
"

pd.read_sql(sql_stmt, conn)

In [ ]:
sql_stmt = "\
SELECT prime_minister AS leader, country \
FROM leaders.prime_ministers \
UNION ALL \
SELECT monarch, country \
FROM leaders.monarchs \
ORDER BY country; \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### UNION

Near **query result** to the right, you will see two new tables with names `economies2010` and `economies2015`.

**Instructions**

* Combine these two tables into one table containing all of the fields in `economies2010`. The `economies` table is also included for reference.
* Sort this resulting single table by country code and then by year, both in ascending order.

```sql
-- Select fields from 2010 table
SELECT *
  -- From 2010 table
  FROM countries.economies2010
    -- Set theory clause
    UNION
-- Select fields from 2015 table
SELECT *
  -- From 2015 table
  FROM countries.economies2015
-- Order by code and year
ORDER BY code, year;
```

In [ ]:
sql_stmt = "\
SELECT * \
  FROM countries.economies2010 \
    UNION \
SELECT * \
  FROM countries.economies2015 \
ORDER BY code, year; \
"

pd.read_sql(sql_stmt, conn)

#### UNION (2)

`UNION` can also be used to determine all occurrences of a field across multiple tables. Try out this exercise with no starter code.

**Instructions**

* Determine all (non-duplicated) country codes in either the `cities` or the `currencies` table. The result should be a table with only one field called `country_code`.
* Sort by `country_code` in alphabetical order.

```sql
-- Select field
SELECT country_code
  -- From cities
  FROM countries.cities
    -- Set theory clause
    UNION
-- Select field
SELECT code
  -- From currencies
  FROM countries.currencies
-- Order by country_code
ORDER BY country_code;
```

In [ ]:
sql_stmt = "\
SELECT country_code \
  FROM countries.cities \
    UNION \
SELECT code \
  FROM countries.currencies \
ORDER BY country_code; \
"

country_codes = pd.read_sql(sql_stmt, conn)
country_codes.head()

In [ ]:
country_codes.tail()

#### UNION ALL

As you saw, duplicates were removed from the previous two exercises by using `UNION`.

To include duplicates, you can use `UNION ALL`.

`Instructions`

* Determine all combinations (include duplicates) of country code and year that exist in either the `economies` or the `populations` tables. Order by `code` then `year`.
* The result of the query should only have two columns/fields. Think about how many records this query should result in.
* You'll use code very similar to this in your next exercise after the video. Make note of this code after completing it.

```sql
-- Select fields
SELECT code, year
  -- From economies
  FROM countries.economies
    -- Set theory clause
    UNION ALL
-- Select fields
SELECT country_code, year
  -- From populations
  FROM countries.populations
-- Order by code, year
ORDER BY code, year;
```

In [ ]:
sql_stmt = "\
SELECT code, year \
  FROM countries.economies \
    UNION ALL \
SELECT country_code, year \
  FROM countries.populations \
ORDER BY code, year; \
"

country_codes_year = pd.read_sql(sql_stmt, conn)
country_codes_year.head()

In [ ]:
country_codes_year.tail()

## INTERSECTional data science

- The set theory clause **`INTERSECT`** works in a similar fashion to `UNION` and `UNION ALL`, but remember from the Venn diagram, `INTERSECT` only includes those records in common to both tables and fields selected.
- ![intersect][1]

```sql
SELECT id
FROM left_one
INTERSECT
SELECT id
FROM right_one;
```

- The result only includes records common to the tables selected
- Determine countries with both a prime minister and president
- The code for each of these set operations has a similar layout.
 - First select which fields to include from the first table, and then specify the name of the first table.
 - Specify the set operation to perform
 - Lastly, denote which fields to include from the second table, and then the name of the second table.
 
```sql
SELECT country
FROM leaders.prime_ministers
INTERSECT
SELECT country
FROM leaders.presidents
```

- **What happens if two columns are selected, instead of one?**

```sql
SELECT country, prime_minister as leader
FROM leaders.prime_ministers
INTERSECT
SELECT country, president
FROM leaders.presidents
```

- Will this also give you the names of the countries with both type of leaders?
- This results in an empty table.
- When `INTERSECT` looks at two columns, it includes both columns in the search.
 - It didn't find any countries with prime ministers **AND** presidents having the same name.
 - `INTERSECT` looks for **records** in common, not individual key fields like what a join does to match.

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/intersect.JPG?raw=true "intersect"

In [ ]:
sql_stmt = "\
SELECT country \
FROM leaders.prime_ministers \
INTERSECT \
SELECT country \
FROM leaders.presidents \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### INTERSECT

Repeat the previous `UNION ALL` exercise, this time looking at the records in common for country code and year for the `economies` and `populations` tables.

**Instructions**

* Again, order by `code` and then by `year`, both in ascending order.
* Note the number of records here (given at the bottom of **query result**) compared to the similar `UNION ALL` query result (814 records).

```sql
-- Select fields
SELECT code, year
  -- From economies
  FROM countries.economies
    -- Set theory clause
    INTERSECT
-- Select fields
SELECT country_code, year
  -- From populations
  FROM countries.populations
-- Order by code and year
ORDER BY code, year;
```

In [ ]:
sql_stmt = "\
SELECT code, year \
  FROM countries.economies \
    INTERSECT \
SELECT country_code, year \
  FROM countries.populations \
ORDER BY code, year; \
"

pd.read_sql(sql_stmt, conn)

#### INTERSECT (2)

As you think about major world cities and their corresponding country, you may ask _which countries also have a city with the same name as their country name_?

**Instructions**

* Use `INTERSECT` to answer this question with `countries` and `cities`!

```sql
-- Select fields
SELECT name
  -- From countries
  FROM countries.countries
    -- Set theory clause
    INTERSECT
-- Select fields
SELECT name
  -- From cities
  FROM countries.cities;
```

In [ ]:
sql_stmt = "\
SELECT name \
  FROM countries.countries \
    INTERSECT \
SELECT name \
  FROM countries.cities; \
"

pd.read_sql(sql_stmt, conn)

**Hong Kong is part of China, but it appears separately here because it has its own ISO country code. Depending upon your analysis, treating Hong Kong separately could be useful or a mistake. Always check your dataset closely before you perform an analysis!**

#### Review UNION and INTERSECT

Which of the following combinations of terms and definitions is correct?

**Answer the question**

* ~~UNION: returns all records (potentially duplicates) in both tables~~
* ~~UNION ALL: returns only unique records~~
* __**INTERSECT: returns only records appearing in both tables**__
* ~~None of the above are matched correctly~~

## EXCEPTional

- **`EXCEPT`** includes only the records in one table, but not in the other.
- There are some monarchs that also act as the prime minister.  One way to determine those monarchs in the monarchs table that do not also hold the title prime minister, is to use the `EXCEPT` clause.

```sql
SELECT monarch, country
FROM leaders.monarchs
EXCEPT
SELECT prime_minister, country
FROM leaders.prime_ministers;
```

- This SQL query selects the monarch field from monarchs, then looks for common entries with the prime_ministers field, while also keeping track of the country for each leader.
- Only the two European monarchs are not also prime ministers in the leaders database.
- ![except][1]
- Only the records that appear in the left table, **BUT DO NOT** appear in the right table are included.

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/except.JPG?raw=true "except"

In [ ]:
sql_stmt = "\
SELECT monarch, country \
FROM leaders.monarchs \
EXCEPT \
SELECT prime_minister, country \
FROM leaders.prime_ministers; \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### EXCEPT

Get the names of cities in `cities` which are not noted as capital cities in `countries` as a single field result.

Note that there are some countries in the world that are not included in the `countries` table, which will result in some cities not being labeled as capital cities when in fact they are.

**Instructions**

* Order the resulting field in ascending order.
* Can you spot the city/cities that are actually capital cities which this query misses?

```sql
-- Select field
SELECT name
  -- From cities
  FROM countries.cities
    -- Set theory clause
    EXCEPT
-- Select field
SELECT capital
  -- From countries
  FROM countries.countries
-- Order by result
ORDER BY name;
```

In [ ]:
sql_stmt = "\
SELECT name \
  FROM countries.cities \
    EXCEPT \
SELECT capital \
  FROM countries.countries \
ORDER BY name; \
"

pd.read_sql(sql_stmt, conn).head()

#### EXCEPT (2)

Now you will complete the previous query in reverse!

Determine the names of capital cities that are not listed in the `cities` table.

**Instructions**

* Order by `capital` in ascending order.
* The `cities` table contains information about 236 of the world's most populous cities. The result of your query may surprise you in terms of the number of capital cities that DO NOT appear in this list!

```sql
-- Select field
SELECT capital
  -- From countries
  FROM countries.countries
    -- Set theory clause
    EXCEPT
-- Select field
SELECT name
  -- From cities
  FROM countries.cities
-- Order by ascending capital
ORDER BY capital;
```

In [ ]:
sql_stmt = "\
SELECT capital \
  FROM countries.countries \
    EXCEPT \
SELECT name \
  FROM countries.cities \
ORDER BY capital; \
"

pd.read_sql(sql_stmt, conn).head()

## Semi-JOINs and Anti-JOINS

- The previous six joins are all additive joins, in that they add columns to the original left table.
 1. INNER JOIN
 1. SELF JOIN
 1. LEFT JOIN
 1. RIGHT JOIN
 1. FULL JOIN
 1. CROSS JOIN
- The last two joins use a right table to determine which records to keep in the left table.
 - Use these last to joins in a way similar to a WHERE clause dependent on the values of a second table.
- `semi-joins` and `anti-joins` don't have the same built-in SQL syntax that INNER JOIN and LEFT JOIN have.
- `semi-joins` and `anti-joins` are useful tools in filtering table records on the records of another table.
- The challenge will be to combine set theory clauses with semi-joins.
- Determine the countries that gained independence before 1800.

```sql
SELECT name
FROM leaders.states
WHERE indep_year < 1800;
```

```python
    country
0  Portugal
1     Spain
```

- Determine president, country and continent

```sql
SELECT president, country, continent
FROM leaders.presidents
```

```python
                 president   country      continent
0     Abdel Fattah el-Sisi     Egypt         Africa
1  Marcelo Rebelo de Sousa  Portugal         Europe
2            Jovenel Moise     Haiti  North America
3              Jose Mujica   Uruguay  South America
4    Ellen Johnson Sirleaf   Liberia         Africa
5        Michelle Bachelet     Chile  South America
6           Tran Dai Quang   Vietnam           Asia
```

### `SEMI JOIN`

- Determine the presidents of countries that gained independence before 1800.

```sql
SELECT president, country, continent
FROM leaders.presidents
WHERE country IN
    (SELECT name
     FROM leaders.states
     WHERE indep_year < 1800);
```

- This is an example of a subquery, which is a query that sits inside another query.
- Does this include the presidents of Spain and Portugal?
 - Since Spain does not have a president, it's not included here and only the Portuguese president is listed.
- The `semi-join` chooses records in the first table where a condition **IS** met in the second table.
- ![semi join][1]
- The `semi-join` matches records by key field in the right table with those in the left.
- It then picks out only the rows in the left table that match the condition.

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/semi_join.JPG?raw=true "semi join"

In [ ]:
sql_stmt = "\
SELECT president, country, continent \
FROM leaders.presidents \
WHERE country IN \
    (SELECT name \
     FROM leaders.states \
     WHERE indep_year < 1800); \
"

pd.read_sql(sql_stmt, conn)

### `ANTI JOIN`

- An `anti-join` chooses records in the first table where a condition **IS NOT** met in the second table.
- Determine countries in the Americas founded after 1800.
- Use `NOT` to exclude those countries in the subquery.

```sql
SELECT president, country, continent
FROM leaders.presidents
WHERE continent LIKE '%America'
    AND country NOT IN
        (SELECT name
         FROM leaders.states
         WHERE indep_year < 1800);
```

- ![anti join][1]
- The `anti-join` picks out those columns in the left table that do not match the condition on the right table.

  [1]: https://raw.githubusercontent.com/trenton3983/DataCamp/master/Images/joining_data_in_sql/anti_join.JPG?raw=true "anti join"

In [ ]:
sql_stmt = "\
SELECT president, country, continent \
FROM leaders.presidents \
WHERE continent LIKE '%%America' \
    AND country NOT IN \
        (SELECT name \
         FROM leaders.states \
         WHERE indep_year < 1800); \
"

pd.read_sql(sql_stmt, conn)

### Exercises

#### Semi-JOIN

#### Relating semi-JOIN to a tweaked INNER JOIN

#### Diagnosing problems using anti-JOIN

#### Set theory challenge

# Subqueries

In this closing chapter, you'll learn how to use nested queries to add some finesse to your data insights. You'll also wrap all of the content covered throughout this course into solving three challenge problems.

## Subqueries inside WHERE and SELECT clauses

### Exercises

#### Subquery inside WHERE

#### Subquery inside WHERE (2)

#### Subquery inside SELECT

## Subquery inside FROM clause

### Exercises

#### Subquery inside FROM

#### Advanced subquery

#### Subquery challenge

#### Subquery review

## Course Review

### Final Challenge

### Final Challenge (2)

### Final Challenge (3)

In [ ]:
conn.close()